#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.shared.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.shared.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lYWI4ODQ2ZS1lNTE1LTRhMWYtODdmZi1kM2U3YzgxYTg4ZTk7b2JqZWN0SWQ9NmYxYjYwY2EtNTM2Mi00ZjA2LWJjOTAtMGFiNGJiMTc4ZjhhO3N1YnNjcmlwdGlvbklkPTg2NGViOWQwLWU5YzQtNGQ2Yi1iZjExLWJkNGNmZGUwNWU4MTt0ZW5hbnRJZD00NDlmYmUxZC05Yzk5LTQ1MDktOTAxNC00ZmQ1Y2YyNWIwMTQ=][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.apim.azurerm_api_management.apim_internal[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_api_management" "apim_internal" {
      [32m+[0m [0m[1m[0mclient_certificate_enabled[0m[0m    = false
      [32m+[0m [0m[1m[0mdeveloper_portal_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mgateway_disabled[0m[0m              = false
      [32m+[0m [0m[1m[0mgateway_regional_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mgateway_url[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmanagement_api_url[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mnotification_sender_email[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mportal_url[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_network_access_enabled[0m[0m = true
      [32m+[0m [0m[1m[0mpublisher_email[0m[0m               = "apim@contoso.com"
      [32m+[0m [0m[1m[0mpublisher_name[0m[0m                = "Contoso"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg-apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mscm_url[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0msku_name[0m[0m                      = "Developer_1"
      [32m+[0m [0m[1m[0mvirtual_network_type[0m[0m          = "Internal"

      [32m+[0m [0mhostname_configuration {
          [32m+[0m [0mdeveloper_portal {
              [32m+[0m [0m[1m[0mcertificate[0m[0m                     = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_password[0m[0m            = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_source[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mcertificate_status[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mexpiry[0m[0m                          = (known after apply)
              [32m+[0m [0m[1m[0mhost_name[0m[0m                       = (known after apply)
              [32m+[0m [0m[1m[0mkey_vault_id[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mnegotiate_client_certificate[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mssl_keyvault_identity_client_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msubject[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mthumbprint[0m[0m                      = (known after apply)
            }

          [32m+[0m [0mmanagement {
              [32m+[0m [0m[1m[0mcertificate[0m[0m                     = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_password[0m[0m            = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_source[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mcertificate_status[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mexpiry[0m[0m                          = (known after apply)
              [32m+[0m [0m[1m[0mhost_name[0m[0m                       = (known after apply)
              [32m+[0m [0m[1m[0mkey_vault_id[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mnegotiate_client_certificate[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mssl_keyvault_identity_client_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msubject[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mthumbprint[0m[0m                      = (known after apply)
            }

          [32m+[0m [0mportal {
              [32m+[0m [0m[1m[0mcertificate[0m[0m                     = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_password[0m[0m            = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_source[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mcertificate_status[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mexpiry[0m[0m                          = (known after apply)
              [32m+[0m [0m[1m[0mhost_name[0m[0m                       = (known after apply)
              [32m+[0m [0m[1m[0mkey_vault_id[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mnegotiate_client_certificate[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mssl_keyvault_identity_client_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msubject[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mthumbprint[0m[0m                      = (known after apply)
            }

          [32m+[0m [0mproxy {
              [32m+[0m [0m[1m[0mcertificate[0m[0m                     = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_password[0m[0m            = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_source[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mcertificate_status[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mdefault_ssl_binding[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mexpiry[0m[0m                          = (known after apply)
              [32m+[0m [0m[1m[0mhost_name[0m[0m                       = (known after apply)
              [32m+[0m [0m[1m[0mkey_vault_id[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mnegotiate_client_certificate[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mssl_keyvault_identity_client_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msubject[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mthumbprint[0m[0m                      = (known after apply)
            }

          [32m+[0m [0mscm {
              [32m+[0m [0m[1m[0mcertificate[0m[0m                     = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_password[0m[0m            = (sensitive value)
              [32m+[0m [0m[1m[0mcertificate_source[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mcertificate_status[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mexpiry[0m[0m                          = (known after apply)
              [32m+[0m [0m[1m[0mhost_name[0m[0m                       = (known after apply)
              [32m+[0m [0m[1m[0mkey_vault_id[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mnegotiate_client_certificate[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mssl_keyvault_identity_client_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msubject[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mthumbprint[0m[0m                      = (known after apply)
            }
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = "SystemAssigned"
        }

      [32m+[0m [0mprotocols {
          [32m+[0m [0m[1m[0menable_http2[0m[0m = (known after apply)
        }

      [32m+[0m [0msecurity {
          [32m+[0m [0m[1m[0menable_backend_ssl30[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0menable_backend_tls10[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0menable_backend_tls11[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0menable_frontend_ssl30[0m[0m                               = (known after apply)
          [32m+[0m [0m[1m[0menable_frontend_tls10[0m[0m                               = (known after apply)
          [32m+[0m [0m[1m[0menable_frontend_tls11[0m[0m                               = (known after apply)
          [32m+[0m [0m[1m[0mtls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtls_rsa_with_aes128_cbc_sha256_ciphers_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mtls_rsa_with_aes128_cbc_sha_ciphers_enabled[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mtls_rsa_with_aes128_gcm_sha256_ciphers_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mtls_rsa_with_aes256_cbc_sha256_ciphers_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mtls_rsa_with_aes256_cbc_sha_ciphers_enabled[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mtriple_des_ciphers_enabled[0m[0m                          = (known after apply)
        }

      [32m+[0m [0msign_in {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0msign_up {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

          [32m+[0m [0mterms_of_service {
              [32m+[0m [0m[1m[0mconsent_required[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menabled[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mtext[0m[0m             = (known after apply)
            }
        }

      [32m+[0m [0mtenant_access {
          [32m+[0m [0m[1m[0menabled[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mprimary_key[0m[0m   = (sensitive value)
          [32m+[0m [0m[1m[0msecondary_key[0m[0m = (sensitive value)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m     = (known after apply)
        }

      [32m+[0m [0mvirtual_network_configuration {
          [32m+[0m [0m[1m[0msubnet_id[0m[0m = (known after apply)
        }
    }

[1m  # module.apim.azurerm_api_management_diagnostic.apim_diagnostic[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_api_management_diagnostic" "apim_diagnostic" {
      [32m+[0m [0m[1m[0malways_log_errors[0m[0m         = true
      [32m+[0m [0m[1m[0mapi_management_logger_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mapi_management_name[0m[0m       = "apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mhttp_correlation_protocol[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0midentifier[0m[0m                = "applicationinsights"
      [32m+[0m [0m[1m[0mlog_client_ip[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0moperation_name_format[0m[0m     = "Name"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m       = "rg-apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0msampling_percentage[0m[0m       = 100
      [32m+[0m [0m[1m[0mverbosity[0m[0m                 = "verbose"

      [32m+[0m [0mbackend_request {
          [32m+[0m [0m[1m[0mbody_bytes[0m[0m     = 32
          [32m+[0m [0m[1m[0mheaders_to_log[0m[0m = [
              [32m+[0m [0m"accept",
              [32m+[0m [0m"content-type",
              [32m+[0m [0m"origin",
            ]
        }

      [32m+[0m [0mbackend_response {
          [32m+[0m [0m[1m[0mbody_bytes[0m[0m     = 32
          [32m+[0m [0m[1m[0mheaders_to_log[0m[0m = [
              [32m+[0m [0m"content-length",
              [32m+[0m [0m"content-type",
              [32m+[0m [0m"origin",
            ]
        }

      [32m+[0m [0mfrontend_request {
          [32m+[0m [0m[1m[0mbody_bytes[0m[0m     = 32
          [32m+[0m [0m[1m[0mheaders_to_log[0m[0m = [
              [32m+[0m [0m"accept",
              [32m+[0m [0m"content-type",
              [32m+[0m [0m"origin",
            ]
        }

      [32m+[0m [0mfrontend_response {
          [32m+[0m [0m[1m[0mbody_bytes[0m[0m     = 32
          [32m+[0m [0m[1m[0mheaders_to_log[0m[0m = [
              [32m+[0m [0m"content-length",
              [32m+[0m [0m"content-type",
              [32m+[0m [0m"origin",
            ]
        }
    }

[1m  # module.apim.azurerm_api_management_logger.apim_logger[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_api_management_logger" "apim_logger" {
      [32m+[0m [0m[1m[0mapi_management_name[0m[0m = "apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mbuffered[0m[0m            = true
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "apim-logger"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mresource_id[0m[0m         = (known after apply)

      [32m+[0m [0mapplication_insights {
          [32m+[0m [0m[1m[0minstrumentation_key[0m[0m = (sensitive value)
        }
    }

[1m  # module.apim.azurerm_resource_group.apim_internal_rg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "apim_internal_rg" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-apim-lza-prod-eastus-001"
    }

[1m  # module.application_gateway.azurerm_application_gateway.network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_application_gateway" "network" {
      [32m+[0m [0m[1m[0menable_http2[0m[0m                = true
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "appgw-001"
      [32m+[0m [0m[1m[0mprivate_endpoint_connection[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m         = "rg-apim-lza-prod-eastus-001"

      [32m+[0m [0mautoscale_configuration {
          [32m+[0m [0m[1m[0mmax_capacity[0m[0m = 3
          [32m+[0m [0m[1m[0mmin_capacity[0m[0m = 2
        }

      [32m+[0m [0mbackend_address_pool {
          [32m+[0m [0m[1m[0mfqdns[0m[0m        = [
              [32m+[0m [0m"apim-lza-prod-eastus-001.azure-api.net",
            ]
          [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mip_addresses[0m[0m = []
          [32m+[0m [0m[1m[0mname[0m[0m         = "apim"
        }

      [32m+[0m [0mbackend_http_settings {
          [32m+[0m [0m[1m[0mcookie_based_affinity[0m[0m               = "Disabled"
          [32m+[0m [0m[1m[0mhost_name[0m[0m                           = "apim-lza-prod-eastus-001.azure-api.net"
          [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                                = "https"
          [32m+[0m [0m[1m[0mpick_host_name_from_backend_address[0m[0m = false
          [32m+[0m [0m[1m[0mport[0m[0m                                = 443
          [32m+[0m [0m[1m[0mprobe_id[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0mprobe_name[0m[0m                          = "APIM"
          [32m+[0m [0m[1m[0mprotocol[0m[0m                            = "Https"
          [32m+[0m [0m[1m[0mrequest_timeout[0m[0m                     = 20
          [32m+[0m [0m[1m[0mtrusted_root_certificate_names[0m[0m      = []
        }
      [32m+[0m [0mbackend_http_settings {
          [32m+[0m [0m[1m[0maffinity_cookie_name[0m[0m                = "ApplicationGatewayAffinity"
          [32m+[0m [0m[1m[0mcookie_based_affinity[0m[0m               = "Disabled"
          [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                                = "default"
          [32m+[0m [0m[1m[0mpick_host_name_from_backend_address[0m[0m = false
          [32m+[0m [0m[1m[0mport[0m[0m                                = 80
          [32m+[0m [0m[1m[0mprobe_id[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0mprotocol[0m[0m                            = "Http"
          [32m+[0m [0m[1m[0mrequest_timeout[0m[0m                     = 20
          [32m+[0m [0m[1m[0mtrusted_root_certificate_names[0m[0m      = []
        }

      [32m+[0m [0mfrontend_ip_configuration {
          [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                          = "appGwPublicFrontendIp"
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "Dynamic"
          [32m+[0m [0m[1m[0mprivate_link_configuration_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
        }

      [32m+[0m [0mfrontend_port {
          [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m = "port_443"
          [32m+[0m [0m[1m[0mport[0m[0m = 443
        }
      [32m+[0m [0mfrontend_port {
          [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m = "port_80"
          [32m+[0m [0m[1m[0mport[0m[0m = 80
        }

      [32m+[0m [0mgateway_ip_configuration {
          [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m      = "appGatewayIpConfig"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m = (known after apply)
        }

      [32m+[0m [0mhttp_listener {
          [32m+[0m [0m[1m[0mfrontend_ip_configuration_id[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfrontend_ip_configuration_name[0m[0m = "appGwPublicFrontendIp"
          [32m+[0m [0m[1m[0mfrontend_port_id[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mfrontend_port_name[0m[0m             = "port_443"
          [32m+[0m [0m[1m[0mhost_names[0m[0m                     = []
          [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                           = "https"
          [32m+[0m [0m[1m[0mprotocol[0m[0m                       = "Https"
          [32m+[0m [0m[1m[0mrequire_sni[0m[0m                    = false
          [32m+[0m [0m[1m[0mssl_certificate_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mssl_certificate_name[0m[0m           = "api.contoso.com"
          [32m+[0m [0m[1m[0mssl_profile_id[0m[0m                 = (known after apply)
        }
      [32m+[0m [0mhttp_listener {
          [32m+[0m [0m[1m[0mfrontend_ip_configuration_id[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfrontend_ip_configuration_name[0m[0m = "appGwPublicFrontendIp"
          [32m+[0m [0m[1m[0mfrontend_port_id[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mfrontend_port_name[0m[0m             = "port_80"
          [32m+[0m [0m[1m[0mhost_names[0m[0m                     = []
          [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                           = "default"
          [32m+[0m [0m[1m[0mprotocol[0m[0m                       = "Http"
          [32m+[0m [0m[1m[0mrequire_sni[0m[0m                    = false
          [32m+[0m [0m[1m[0mssl_certificate_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mssl_profile_id[0m[0m                 = (known after apply)
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = "UserAssigned"
        }

      [32m+[0m [0mprobe {
          [32m+[0m [0m[1m[0mhost[0m[0m                                      = "apim-lza-prod-eastus-001.azure-api.net"
          [32m+[0m [0m[1m[0mid[0m[0m                                        = (known after apply)
          [32m+[0m [0m[1m[0minterval[0m[0m                                  = 30
          [32m+[0m [0m[1m[0mminimum_servers[0m[0m                           = 0
          [32m+[0m [0m[1m[0mname[0m[0m                                      = "APIM"
          [32m+[0m [0m[1m[0mpath[0m[0m                                      = "/status-0123456789abcdef"
          [32m+[0m [0m[1m[0mpick_host_name_from_backend_http_settings[0m[0m = false
          [32m+[0m [0m[1m[0mprotocol[0m[0m                                  = "Https"
          [32m+[0m [0m[1m[0mtimeout[0m[0m                                   = 30
          [32m+[0m [0m[1m[0munhealthy_threshold[0m[0m                       = 3

          [32m+[0m [0mmatch {
              [32m+[0m [0m[1m[0mstatus_code[0m[0m = [
                  [32m+[0m [0m"200-399",
                ]
            }
        }

      [32m+[0m [0mrequest_routing_rule {
          [32m+[0m [0m[1m[0mbackend_address_pool_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mbackend_address_pool_name[0m[0m  = "apim"
          [32m+[0m [0m[1m[0mbackend_http_settings_id[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mbackend_http_settings_name[0m[0m = "https"
          [32m+[0m [0m[1m[0mhttp_listener_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mhttp_listener_name[0m[0m         = "https"
          [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                       = "apim"
          [32m+[0m [0m[1m[0mpriority[0m[0m                   = 100
          [32m+[0m [0m[1m[0mredirect_configuration_id[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mrewrite_rule_set_id[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mrule_type[0m[0m                  = "Basic"
          [32m+[0m [0m[1m[0murl_path_map_id[0m[0m            = (known after apply)
        }

      [32m+[0m [0msku {
          [32m+[0m [0m[1m[0mname[0m[0m = "WAF_v2"
          [32m+[0m [0m[1m[0mtier[0m[0m = "WAF_v2"
        }

      [32m+[0m [0mssl_certificate {
          [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkey_vault_secret_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                = "api.contoso.com"
          [32m+[0m [0m[1m[0mpublic_cert_data[0m[0m    = (known after apply)
        }

      [32m+[0m [0mssl_policy {
          [32m+[0m [0m[1m[0mcipher_suites[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mdisabled_protocols[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmin_protocol_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpolicy_name[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpolicy_type[0m[0m          = (known after apply)
        }

      [32m+[0m [0mwaf_configuration {
          [32m+[0m [0m[1m[0menabled[0m[0m                  = true
          [32m+[0m [0m[1m[0mfile_upload_limit_mb[0m[0m     = 100
          [32m+[0m [0m[1m[0mfirewall_mode[0m[0m            = "Detection"
          [32m+[0m [0m[1m[0mmax_request_body_size_kb[0m[0m = 128
          [32m+[0m [0m[1m[0mrequest_body_check[0m[0m       = true
          [32m+[0m [0m[1m[0mrule_set_type[0m[0m            = "OWASP"
          [32m+[0m [0m[1m[0mrule_set_version[0m[0m         = "3.0"
        }
    }

[1m  # module.application_gateway.azurerm_key_vault_access_policy.user_assigned_identity_keyvault_permissions[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_key_vault_access_policy" "user_assigned_identity_keyvault_permissions" {
      [32m+[0m [0m[1m[0mcertificate_permissions[0m[0m = [
          [32m+[0m [0m"Import",
          [32m+[0m [0m"Get",
          [32m+[0m [0m"List",
          [32m+[0m [0m"Update",
          [32m+[0m [0m"Create",
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecret_permissions[0m[0m      = [
          [32m+[0m [0m"Get",
          [32m+[0m [0m"List",
        ]
      [32m+[0m [0m[1m[0mtenant_id[0m[0m               = (known after apply)
    }

[1m  # module.application_gateway.azurerm_key_vault_certificate.local_domain_certs[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_key_vault_certificate" "local_domain_certs" {
      [32m+[0m [0m[1m[0mcertificate_attribute[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_data[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_data_base64[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                    = "generated-cert"
      [32m+[0m [0m[1m[0msecret_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mthumbprint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mversionless_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mversionless_secret_id[0m[0m   = (known after apply)

      [32m+[0m [0mcertificate_policy {
          [32m+[0m [0missuer_parameters {
              [32m+[0m [0m[1m[0mname[0m[0m = "Self"
            }

          [32m+[0m [0mkey_properties {
              [32m+[0m [0m[1m[0mcurve[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mexportable[0m[0m = true
              [32m+[0m [0m[1m[0mkey_size[0m[0m   = 2048
              [32m+[0m [0m[1m[0mkey_type[0m[0m   = "RSA"
              [32m+[0m [0m[1m[0mreuse_key[0m[0m  = true
            }

          [32m+[0m [0mlifetime_action {
              [32m+[0m [0maction {
                  [32m+[0m [0m[1m[0maction_type[0m[0m = "AutoRenew"
                }

              [32m+[0m [0mtrigger {
                  [32m+[0m [0m[1m[0mdays_before_expiry[0m[0m = 30
                }
            }

          [32m+[0m [0msecret_properties {
              [32m+[0m [0m[1m[0mcontent_type[0m[0m = "application/x-pkcs12"
            }

          [32m+[0m [0mx509_certificate_properties {
              [32m+[0m [0m[1m[0mextended_key_usage[0m[0m = [
                  [32m+[0m [0m"1.3.6.1.5.5.7.3.1",
                ]
              [32m+[0m [0m[1m[0mkey_usage[0m[0m          = [
                  [32m+[0m [0m"digitalSignature",
                  [32m+[0m [0m"keyEncipherment",
                ]
              [32m+[0m [0m[1m[0msubject[0m[0m            = "CN=api.contoso.com"
              [32m+[0m [0m[1m[0mvalidity_in_months[0m[0m = 12

              [32m+[0m [0msubject_alternative_names {
                  [32m+[0m [0m[1m[0mdns_names[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0memails[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mupns[0m[0m      = (known after apply)
                }
            }
        }
    }

[1m  # module.application_gateway.azurerm_public_ip.public_ip[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "public_ip" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Static"
      [32m+[0m [0m[1m[0mddos_protection_mode[0m[0m    = "VirtualNetworkInherited"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-appgw-001"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0msku_tier[0m[0m                = "Regional"
    }

[1m  # module.application_gateway.azurerm_user_assigned_identity.user_assigned_identity[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m [0m[1m[0mclient_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "identity-appgw-001"
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mtenant_id[0m[0m           = (known after apply)
    }

[1m  # module.backend.azurerm_linux_function_app.function_app[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_function_app" "function_app" {
      [32m+[0m [0m[1m[0mapp_settings[0m[0m                      = {
          [32m+[0m [0m"FUNCTIONS_WORKER_RUNTIME" = "dotnet"
          [32m+[0m [0m"WEBSITE_RUN_FROM_PACKAGE" = ""
        }
      [32m+[0m [0m[1m[0mbuiltin_logging_enabled[0m[0m           = true
      [32m+[0m [0m[1m[0mclient_certificate_enabled[0m[0m        = false
      [32m+[0m [0m[1m[0mclient_certificate_mode[0m[0m           = "Optional"
      [32m+[0m [0m[1m[0mcontent_share_force_disabled[0m[0m      = false
      [32m+[0m [0m[1m[0mcustom_domain_verification_id[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mdaily_memory_time_quota[0m[0m           = 0
      [32m+[0m [0m[1m[0mdefault_hostname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                           = true
      [32m+[0m [0m[1m[0mfunctions_extension_version[0m[0m       = "~4"
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                        = true
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "func-code-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0moutbound_ip_address_list[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_address_list[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "rg-backend-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mservice_plan_id[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0msite_credential[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_access_key[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mstorage_account_name[0m[0m              = "stbackendlzaeastus"
      [32m+[0m [0m[1m[0mstorage_uses_managed_identity[0m[0m     = false

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_parameters[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mapp_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m            = (known after apply)
            }

          [32m+[0m [0mgithub {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mconsumer_secret_setting_name[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                               = (known after apply)
          [32m+[0m [0m[1m[0mapp_scale_limit[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mcontainer_registry_use_managed_identity[0m[0m = false
          [32m+[0m [0m[1m[0mdefault_documents[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mdetailed_error_logging_enabled[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0melastic_instance_minimum[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mftps_state[0m[0m                              = "Disabled"
          [32m+[0m [0m[1m[0mhealth_check_eviction_time_in_min[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m                           = false
          [32m+[0m [0m[1m[0mip_restriction[0m[0m                          = [
              [32m+[0m [0m{
                  [32m+[0m [0maction                    = "Allow"
                  [32m+[0m [0mheaders                   = [90mnull[0m[0m
                  [32m+[0m [0mip_address                = [90mnull[0m[0m
                  [32m+[0m [0mname                      = (known after apply)
                  [32m+[0m [0mpriority                  = 65000
                  [32m+[0m [0mservice_tag               = [90mnull[0m[0m
                  [32m+[0m [0mvirtual_network_subnet_id = (known after apply)
                },
            ]
          [32m+[0m [0m[1m[0mlinux_fx_version[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mload_balancing_mode[0m[0m                     = "LeastRequests"
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m                   = "Integrated"
          [32m+[0m [0m[1m[0mminimum_tls_version[0m[0m                     = "1.2"
          [32m+[0m [0m[1m[0mpre_warmed_instance_count[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m                = false
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mscm_minimum_tls_version[0m[0m                 = "1.2"
          [32m+[0m [0m[1m[0mscm_type[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m             = false
          [32m+[0m [0m[1m[0muse_32_bit_worker[0m[0m                       = false
          [32m+[0m [0m[1m[0mvnet_route_all_enabled[0m[0m                  = false
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m                      = false
          [32m+[0m [0m[1m[0mworker_count[0m[0m                            = (known after apply)

          [32m+[0m [0mapplication_stack {
              [32m+[0m [0m[1m[0mdotnet_version[0m[0m              = "3.1"
              [32m+[0m [0m[1m[0muse_dotnet_isolated_runtime[0m[0m = false
            }
        }
    }

[1m  # module.backend.azurerm_linux_function_app.function_app_container[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_function_app" "function_app_container" {
      [32m+[0m [0m[1m[0mapp_settings[0m[0m                      = {
          [32m+[0m [0m"FUNCTIONS_WORKER_RUNTIME" = "dotnet"
          [32m+[0m [0m"WEBSITE_RUN_FROM_PACKAGE" = ""
        }
      [32m+[0m [0m[1m[0mbuiltin_logging_enabled[0m[0m           = true
      [32m+[0m [0m[1m[0mclient_certificate_enabled[0m[0m        = false
      [32m+[0m [0m[1m[0mclient_certificate_mode[0m[0m           = "Optional"
      [32m+[0m [0m[1m[0mcontent_share_force_disabled[0m[0m      = false
      [32m+[0m [0m[1m[0mcustom_domain_verification_id[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mdaily_memory_time_quota[0m[0m           = 0
      [32m+[0m [0m[1m[0mdefault_hostname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                           = true
      [32m+[0m [0m[1m[0mfunctions_extension_version[0m[0m       = "~4"
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                        = true
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "func-cont-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0moutbound_ip_address_list[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_address_list[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "rg-backend-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mservice_plan_id[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0msite_credential[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_access_key[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mstorage_account_name[0m[0m              = "stbackendlzaeastus"
      [32m+[0m [0m[1m[0mstorage_uses_managed_identity[0m[0m     = false

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_parameters[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mapp_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m            = (known after apply)
            }

          [32m+[0m [0mgithub {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mconsumer_secret_setting_name[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                               = (known after apply)
          [32m+[0m [0m[1m[0mapp_scale_limit[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mcontainer_registry_use_managed_identity[0m[0m = false
          [32m+[0m [0m[1m[0mdefault_documents[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mdetailed_error_logging_enabled[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0melastic_instance_minimum[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mftps_state[0m[0m                              = "Disabled"
          [32m+[0m [0m[1m[0mhealth_check_eviction_time_in_min[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m                           = false
          [32m+[0m [0m[1m[0mip_restriction[0m[0m                          = [
              [32m+[0m [0m{
                  [32m+[0m [0maction                    = "Allow"
                  [32m+[0m [0mheaders                   = [90mnull[0m[0m
                  [32m+[0m [0mip_address                = [90mnull[0m[0m
                  [32m+[0m [0mname                      = (known after apply)
                  [32m+[0m [0mpriority                  = 65000
                  [32m+[0m [0mservice_tag               = [90mnull[0m[0m
                  [32m+[0m [0mvirtual_network_subnet_id = (known after apply)
                },
            ]
          [32m+[0m [0m[1m[0mlinux_fx_version[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mload_balancing_mode[0m[0m                     = "LeastRequests"
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m                   = "Integrated"
          [32m+[0m [0m[1m[0mminimum_tls_version[0m[0m                     = "1.2"
          [32m+[0m [0m[1m[0mpre_warmed_instance_count[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m                = false
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mscm_minimum_tls_version[0m[0m                 = "1.2"
          [32m+[0m [0m[1m[0mscm_type[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m             = false
          [32m+[0m [0m[1m[0muse_32_bit_worker[0m[0m                       = false
          [32m+[0m [0m[1m[0mvnet_route_all_enabled[0m[0m                  = false
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m                      = false
          [32m+[0m [0m[1m[0mworker_count[0m[0m                            = (known after apply)

          [32m+[0m [0mapplication_stack {
              [32m+[0m [0m[1m[0muse_dotnet_isolated_runtime[0m[0m = false

              [32m+[0m [0mdocker {
                  [32m+[0m [0m[1m[0mimage_name[0m[0m   = "azure-functions/dotnet"
                  [32m+[0m [0m[1m[0mimage_tag[0m[0m    = "latest"
                  [32m+[0m [0m[1m[0mregistry_url[0m[0m = "mcr.microsoft.com"
                }
            }
        }
    }

[1m  # module.backend.azurerm_resource_group.backend_rg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "backend_rg" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-backend-lza-prod-eastus-001"
    }

[1m  # module.backend.azurerm_service_plan.function_app_service_plan[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_service_plan" "function_app_service_plan" {
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                     = "eastus"
      [32m+[0m [0m[1m[0mmaximum_elastic_worker_count[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "asp-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mos_type[0m[0m                      = "Linux"
      [32m+[0m [0m[1m[0mper_site_scaling_enabled[0m[0m     = false
      [32m+[0m [0m[1m[0mreserved[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "rg-backend-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0msku_name[0m[0m                     = "P1v2"
      [32m+[0m [0m[1m[0mworker_count[0m[0m                 = (known after apply)
    }

[1m  # module.backend.azurerm_storage_account.backend_storage_account[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "backend_storage_account" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                      = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m          = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                      = "Standard"
      [32m+[0m [0m[1m[0mallow_nested_items_to_be_public[0m[0m   = true
      [32m+[0m [0m[1m[0mcross_tenant_replication_enabled[0m[0m  = true
      [32m+[0m [0m[1m[0mdefault_to_oauth_authentication[0m[0m   = false
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0minfrastructure_encryption_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                    = false
      [32m+[0m [0m[1m[0mlarge_file_share_enabled[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "eastus"
      [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                   = "TLS1_2"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "stbackendlzaeastus"
      [32m+[0m [0m[1m[0mnfsv3_enabled[0m[0m                     = false
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m    = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mpublic_network_access_enabled[0m[0m     = true
      [32m+[0m [0m[1m[0mqueue_encryption_key_type[0m[0m         = "Service"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "rg-backend-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m              = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m  = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mshared_access_key_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0mtable_encryption_key_type[0m[0m         = "Service"

      [32m+[0m [0mblob_properties {
          [32m+[0m [0m[1m[0mchange_feed_enabled[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mchange_feed_retention_in_days[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_service_version[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlast_access_time_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mversioning_enabled[0m[0m            = (known after apply)

          [32m+[0m [0mcontainer_delete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)

          [32m+[0m [0mprivate_link_access {
              [32m+[0m [0m[1m[0mendpoint_resource_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mendpoint_tenant_id[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }

      [32m+[0m [0mrouting {
          [32m+[0m [0m[1m[0mchoice[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mpublish_internet_endpoints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpublish_microsoft_endpoints[0m[0m = (known after apply)
        }

      [32m+[0m [0mshare_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mretention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0msmb {
              [32m+[0m [0m[1m[0mauthentication_types[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mchannel_encryption_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mkerberos_ticket_encryption_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmultichannel_enabled[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mversions[0m[0m                        = (known after apply)
            }
        }
    }

[1m  # module.networking.azurerm_bastion_host.bastion_host[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_bastion_host" "bastion_host" {
      [32m+[0m [0m[1m[0mcopy_paste_enabled[0m[0m     = true
      [32m+[0m [0m[1m[0mdns_name[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mfile_copy_enabled[0m[0m      = false
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mip_connect_enabled[0m[0m     = false
      [32m+[0m [0m[1m[0mlocation[0m[0m               = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                   = "bastion-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m    = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0mscale_units[0m[0m            = 2
      [32m+[0m [0m[1m[0mshareable_link_enabled[0m[0m = false
      [32m+[0m [0m[1m[0msku[0m[0m                    = "Basic"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Owner" = "APIM Const Set"
        }
      [32m+[0m [0m[1m[0mtunneling_enabled[0m[0m      = false

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                 = "bastionipcfg-lza-prod-eastus"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
        }
    }

[1m  # module.networking.azurerm_network_security_group.apim_snnsg_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "apim_snnsg_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-apim-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = [
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "AzureKeyVault"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "apim-azure-kv"
              [32m+[0m [0mpriority                                   = 2020
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "VirtualNetwork"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "SQL"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "1443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "apim-azure-sql"
              [32m+[0m [0mpriority                                   = 2010
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "VirtualNetwork"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "Storage"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "apim-azure-storage"
              [32m+[0m [0mpriority                                   = 2000
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "VirtualNetwork"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "VirtualNetwork"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "3443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowApimVnetInbound"
              [32m+[0m [0mpriority                                   = 2000
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "ApiManagement"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "VirtualNetwork"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "6390"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "apim-azure-infra-lb"
              [32m+[0m [0mpriority                                   = 2010
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "AzureLoadBalancer"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
        ]
    }

[1m  # module.networking.azurerm_network_security_group.appgateway_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "appgateway_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-apgw-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = [
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "*"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowAzureLoadBalancerInbound"
              [32m+[0m [0mpriority                                   = 121
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "AzureLoadBalancer"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowTLSInbound"
              [32m+[0m [0mpriority                                   = 110
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "*"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "65200-65535"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowHealthProbesInbound"
              [32m+[0m [0mpriority                                   = 100
              [32m+[0m [0mprotocol                                   = "*"
              [32m+[0m [0msource_address_prefix                      = "GatewayManager"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "80"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowHTTPInbound"
              [32m+[0m [0mpriority                                   = 111
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "*"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
        ]
    }

[1m  # module.networking.azurerm_network_security_group.backend_snnsg_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "backend_snnsg_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-bcke-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = (known after apply)
    }

[1m  # module.networking.azurerm_network_security_group.bastion_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "bastion_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-bast-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = [
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowAzureLoadBalancerInbound"
              [32m+[0m [0mpriority                                   = 140
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "AzureLoadBalancer"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowGatewayManagerInbound"
              [32m+[0m [0mpriority                                   = 130
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "GatewayManager"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "*"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowHttpsInbound"
              [32m+[0m [0mpriority                                   = 120
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "Internet"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "AzureCloud"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "443"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "AllowAzureCloudOutbound"
              [32m+[0m [0mpriority                                   = 110
              [32m+[0m [0mprotocol                                   = "Tcp"
              [32m+[0m [0msource_address_prefix                      = "*"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "Internet"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = "80"
              [32m+[0m [0mdestination_port_ranges                    = []
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "AllowGetSessionInformation"
              [32m+[0m [0mpriority                                   = 130
              [32m+[0m [0mprotocol                                   = "*"
              [32m+[0m [0msource_address_prefix                      = "*"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "VirtualNetwork"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = ""
              [32m+[0m [0mdestination_port_ranges                    = [
                  [32m+[0m [0m"22",
                  [32m+[0m [0m"3389",
                ]
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "AllowSshRdpOutbound"
              [32m+[0m [0mpriority                                   = 100
              [32m+[0m [0mprotocol                                   = "*"
              [32m+[0m [0msource_address_prefix                      = "*"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "VirtualNetwork"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = ""
              [32m+[0m [0mdestination_port_ranges                    = [
                  [32m+[0m [0m"5701",
                  [32m+[0m [0m"8080",
                ]
              [32m+[0m [0mdirection                                  = "Inbound"
              [32m+[0m [0mname                                       = "AllowBastionHostCommunicationInbound"
              [32m+[0m [0mpriority                                   = 150
              [32m+[0m [0mprotocol                                   = "*"
              [32m+[0m [0msource_address_prefix                      = "VirtualNetwork"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
          [32m+[0m [0m{
              [32m+[0m [0maccess                                     = "Allow"
              [32m+[0m [0mdescription                                = ""
              [32m+[0m [0mdestination_address_prefix                 = "VirtualNetwork"
              [32m+[0m [0mdestination_address_prefixes               = []
              [32m+[0m [0mdestination_application_security_group_ids = []
              [32m+[0m [0mdestination_port_range                     = ""
              [32m+[0m [0mdestination_port_ranges                    = [
                  [32m+[0m [0m"5701",
                  [32m+[0m [0m"8080",
                ]
              [32m+[0m [0mdirection                                  = "Outbound"
              [32m+[0m [0mname                                       = "AllowBastionCommunication"
              [32m+[0m [0mpriority                                   = 120
              [32m+[0m [0mprotocol                                   = "*"
              [32m+[0m [0msource_address_prefix                      = "VirtualNetwork"
              [32m+[0m [0msource_address_prefixes                    = []
              [32m+[0m [0msource_application_security_group_ids      = []
              [32m+[0m [0msource_port_range                          = "*"
              [32m+[0m [0msource_port_ranges                         = []
            },
        ]
    }

[1m  # module.networking.azurerm_network_security_group.devops_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "devops_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-devops-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = (known after apply)
    }

[1m  # module.networking.azurerm_network_security_group.jumpbox_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "jumpbox_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-jbox-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = (known after apply)
    }

[1m  # module.networking.azurerm_network_security_group.private_endpoint_snnsg_nsg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "private_endpoint_snnsg_nsg" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "nsg-prep-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msecurity_rule[0m[0m       = (known after apply)
    }

[1m  # module.networking.azurerm_public_ip.bastion_public_ip[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "bastion_public_ip" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Static"
      [32m+[0m [0m[1m[0mddos_protection_mode[0m[0m    = "VirtualNetworkInherited"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-bastion-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0msku_tier[0m[0m                = "Regional"
    }

[1m  # module.networking.azurerm_public_ip.public_ip[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "public_ip" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Dynamic"
      [32m+[0m [0m[1m[0mddos_protection_mode[0m[0m    = "VirtualNetworkInherited"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-apimcs-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Basic"
      [32m+[0m [0m[1m[0msku_tier[0m[0m                = "Regional"
    }

[1m  # module.networking.azurerm_resource_group.networking_resourece_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "networking_resourece_group" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-networking-lza-prod-eastus"
    }

[1m  # module.networking.azurerm_virtual_network.apim_cs_vnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "apim_cs_vnet" {
      [32m+[0m [0m[1m[0maddress_space[0m[0m       = [
          [32m+[0m [0m"10.2.0.0/16",
        ]
      [32m+[0m [0m[1m[0mdns_servers[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mguid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "vnet-apim-cs-lza-prod-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-networking-lza-prod-eastus"
      [32m+[0m [0m[1m[0msubnet[0m[0m              = [
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.1.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "AzureBastionSubnet"
              [32m+[0m [0msecurity_group = (known after apply)
            },
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.2.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "snet-devops-lza-prod-eastus"
              [32m+[0m [0msecurity_group = (known after apply)
            },
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.3.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "snet-jbox-lza-prod-eastus-001"
              [32m+[0m [0msecurity_group = (known after apply)
            },
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.4.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "snet-apgw-lza-prod-eastus-001"
              [32m+[0m [0msecurity_group = (known after apply)
            },
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.5.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "snet-prep-lza-prod-eastus-001"
              [32m+[0m [0msecurity_group = (known after apply)
            },
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.6.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "snet-bcke-lza-prod-eastus-001"
              [32m+[0m [0msecurity_group = (known after apply)
            },
          [32m+[0m [0m{
              [32m+[0m [0maddress_prefix = "10.2.7.0/24"
              [32m+[0m [0mid             = (known after apply)
              [32m+[0m [0mname           = "snet-apim-lza-prod-eastus-001"
              [32m+[0m [0msecurity_group = (known after apply)
            },
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"Owner" = "APIM Const Set"
        }
    }

[1m  # module.shared.azurerm_application_insights.shared_apim_insight[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_application_insights" "shared_apim_insight" {
      [32m+[0m [0m[1m[0mapp_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mapplication_type[0m[0m                      = "web"
      [32m+[0m [0m[1m[0mconnection_string[0m[0m                     = (sensitive value)
      [32m+[0m [0m[1m[0mdaily_data_cap_in_gb[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdaily_data_cap_notifications_disabled[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdisable_ip_masking[0m[0m                    = false
      [32m+[0m [0m[1m[0mforce_customer_storage_for_profiler[0m[0m   = false
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0minstrumentation_key[0m[0m                   = (sensitive value)
      [32m+[0m [0m[1m[0minternet_ingestion_enabled[0m[0m            = true
      [32m+[0m [0m[1m[0minternet_query_enabled[0m[0m                = true
      [32m+[0m [0m[1m[0mlocal_authentication_disabled[0m[0m         = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                              = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                                  = "appi-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                   = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m                     = 90
      [32m+[0m [0m[1m[0msampling_percentage[0m[0m                   = 100
      [32m+[0m [0m[1m[0mworkspace_id[0m[0m                          = (known after apply)
    }

[1m  # module.shared.azurerm_key_vault.key_vault[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m [0m[1m[0maccess_policy[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                          = "kv-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mpublic_network_access_enabled[0m[0m = true
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0msku_name[0m[0m                      = "standard"
      [32m+[0m [0m[1m[0msoft_delete_retention_days[0m[0m    = 90
      [32m+[0m [0m[1m[0mtenant_id[0m[0m                     = "449fbe1d-9c99-4509-9014-4fd5cf25b014"
      [32m+[0m [0m[1m[0mvault_uri[0m[0m                     = (known after apply)

      [32m+[0m [0mnetwork_acls {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)
        }
    }

[1m  # module.shared.azurerm_key_vault_access_policy.deployment_spn_access_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_key_vault_access_policy" "deployment_spn_access_policy" {
      [32m+[0m [0m[1m[0mcertificate_permissions[0m[0m = [
          [32m+[0m [0m"Import",
          [32m+[0m [0m"Get",
          [32m+[0m [0m"List",
          [32m+[0m [0m"Update",
          [32m+[0m [0m"Create",
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkey_permissions[0m[0m         = [
          [32m+[0m [0m"Get",
        ]
      [32m+[0m [0m[1m[0mkey_vault_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m               = "6f1b60ca-5362-4f06-bc90-0ab4bb178f8a"
      [32m+[0m [0m[1m[0msecret_permissions[0m[0m      = [
          [32m+[0m [0m"Get",
        ]
      [32m+[0m [0m[1m[0mstorage_permissions[0m[0m     = [
          [32m+[0m [0m"Get",
        ]
      [32m+[0m [0m[1m[0mtenant_id[0m[0m               = "449fbe1d-9c99-4509-9014-4fd5cf25b014"
    }

[1m  # module.shared.azurerm_log_analytics_workspace.log_analytics_workspace[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_log_analytics_workspace" "log_analytics_workspace" {
      [32m+[0m [0m[1m[0mdaily_quota_gb[0m[0m                     = -1
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0minternet_ingestion_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0minternet_query_enabled[0m[0m             = true
      [32m+[0m [0m[1m[0mlocation[0m[0m                           = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                               = "log-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mprimary_shared_key[0m[0m                 = (sensitive value)
      [32m+[0m [0m[1m[0mreservation_capacity_in_gb_per_day[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m                  = 30
      [32m+[0m [0m[1m[0msecondary_shared_key[0m[0m               = (sensitive value)
      [32m+[0m [0m[1m[0msku[0m[0m                                = "PerGB2018"
      [32m+[0m [0m[1m[0mworkspace_id[0m[0m                       = (known after apply)
    }

[1m  # module.shared.azurerm_network_interface.vm_nic[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "vm_nic" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "jumpbox-prod-nic"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mgateway_load_balancer_frontend_ip_configuration_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                                               = "internal"
          [32m+[0m [0m[1m[0mprimary[0m[0m                                            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m                                 = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m                      = "Dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m                         = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                                          = (known after apply)
        }
    }

[1m  # module.shared.azurerm_private_dns_a_record.dev_portal_record[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_a_record" "dev_portal_record" {
      [32m+[0m [0m[1m[0mfqdn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "portal"
      [32m+[0m [0m[1m[0mrecords[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mttl[0m[0m                 = 300
      [32m+[0m [0m[1m[0mzone_name[0m[0m           = "portal.azure-api.net"
    }

[1m  # module.shared.azurerm_private_dns_a_record.gateway_record[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_a_record" "gateway_record" {
      [32m+[0m [0m[1m[0mfqdn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "apim-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mrecords[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mttl[0m[0m                 = 36000
      [32m+[0m [0m[1m[0mzone_name[0m[0m           = "azure-api.net"
    }

[1m  # module.shared.azurerm_private_dns_a_record.mgmt_portal_record[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_a_record" "mgmt_portal_record" {
      [32m+[0m [0m[1m[0mfqdn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "management"
      [32m+[0m [0m[1m[0mrecords[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mttl[0m[0m                 = 300
      [32m+[0m [0m[1m[0mzone_name[0m[0m           = "management.azure-api.net"
    }

[1m  # module.shared.azurerm_private_dns_a_record.new_dev_portal_record[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_a_record" "new_dev_portal_record" {
      [32m+[0m [0m[1m[0mfqdn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "developer"
      [32m+[0m [0m[1m[0mrecords[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mttl[0m[0m                 = 300
      [32m+[0m [0m[1m[0mzone_name[0m[0m           = "developer.azure-api.net"
    }

[1m  # module.shared.azurerm_private_dns_a_record.scm_record[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_a_record" "scm_record" {
      [32m+[0m [0m[1m[0mfqdn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "scm"
      [32m+[0m [0m[1m[0mrecords[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mttl[0m[0m                 = 300
      [32m+[0m [0m[1m[0mzone_name[0m[0m           = "scm.azure-api.net"
    }

[1m  # module.shared.azurerm_private_dns_zone.dev_portal[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "dev_portal" {
      [32m+[0m [0m[1m[0mid[0m[0m                                                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_record_sets[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links_with_registration[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                                  = "portal.azure-api.net"
      [32m+[0m [0m[1m[0mnumber_of_record_sets[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                                   = "rg-shared-lza-prod-eastus-001"

      [32m+[0m [0msoa_record {
          [32m+[0m [0m[1m[0memail[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mexpire_time[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfqdn[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhost_name[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mminimum_ttl[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mrefresh_time[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mretry_time[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mserial_number[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mttl[0m[0m           = (known after apply)
        }
    }

[1m  # module.shared.azurerm_private_dns_zone.gateway[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "gateway" {
      [32m+[0m [0m[1m[0mid[0m[0m                                                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_record_sets[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links_with_registration[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                                  = "azure-api.net"
      [32m+[0m [0m[1m[0mnumber_of_record_sets[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                                   = "rg-shared-lza-prod-eastus-001"

      [32m+[0m [0msoa_record {
          [32m+[0m [0m[1m[0memail[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mexpire_time[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfqdn[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhost_name[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mminimum_ttl[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mrefresh_time[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mretry_time[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mserial_number[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mttl[0m[0m           = (known after apply)
        }
    }

[1m  # module.shared.azurerm_private_dns_zone.mgmt_portal[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "mgmt_portal" {
      [32m+[0m [0m[1m[0mid[0m[0m                                                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_record_sets[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links_with_registration[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                                  = "management.azure-api.net"
      [32m+[0m [0m[1m[0mnumber_of_record_sets[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                                   = "rg-shared-lza-prod-eastus-001"

      [32m+[0m [0msoa_record {
          [32m+[0m [0m[1m[0memail[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mexpire_time[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfqdn[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhost_name[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mminimum_ttl[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mrefresh_time[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mretry_time[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mserial_number[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mttl[0m[0m           = (known after apply)
        }
    }

[1m  # module.shared.azurerm_private_dns_zone.new_dev_portal[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "new_dev_portal" {
      [32m+[0m [0m[1m[0mid[0m[0m                                                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_record_sets[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links_with_registration[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                                  = "developer.azure-api.net"
      [32m+[0m [0m[1m[0mnumber_of_record_sets[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                                   = "rg-shared-lza-prod-eastus-001"

      [32m+[0m [0msoa_record {
          [32m+[0m [0m[1m[0memail[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mexpire_time[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfqdn[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhost_name[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mminimum_ttl[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mrefresh_time[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mretry_time[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mserial_number[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mttl[0m[0m           = (known after apply)
        }
    }

[1m  # module.shared.azurerm_private_dns_zone.scm[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "scm" {
      [32m+[0m [0m[1m[0mid[0m[0m                                                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_record_sets[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmax_number_of_virtual_network_links_with_registration[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                                  = "scm.azure-api.net"
      [32m+[0m [0m[1m[0mnumber_of_record_sets[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                                   = "rg-shared-lza-prod-eastus-001"

      [32m+[0m [0msoa_record {
          [32m+[0m [0m[1m[0memail[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mexpire_time[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfqdn[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhost_name[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mminimum_ttl[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mrefresh_time[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mretry_time[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mserial_number[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mttl[0m[0m           = (known after apply)
        }
    }

[1m  # module.shared.azurerm_private_dns_zone_virtual_network_link.dev_portal_vnetlink[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "dev_portal_vnetlink" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "portal-vnet-link"
      [32m+[0m [0m[1m[0mprivate_dns_zone_name[0m[0m = "portal.azure-api.net"
      [32m+[0m [0m[1m[0mregistration_enabled[0m[0m  = false
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mvirtual_network_id[0m[0m    = (known after apply)
    }

[1m  # module.shared.azurerm_private_dns_zone_virtual_network_link.gateway_vnetlink[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "gateway_vnetlink" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "gateway-vnet-link"
      [32m+[0m [0m[1m[0mprivate_dns_zone_name[0m[0m = "azure-api.net"
      [32m+[0m [0m[1m[0mregistration_enabled[0m[0m  = false
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mvirtual_network_id[0m[0m    = (known after apply)
    }

[1m  # module.shared.azurerm_private_dns_zone_virtual_network_link.mgmt_vnetlink[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "mgmt_vnetlink" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "mgmt-vnet-link"
      [32m+[0m [0m[1m[0mprivate_dns_zone_name[0m[0m = "management.azure-api.net"
      [32m+[0m [0m[1m[0mregistration_enabled[0m[0m  = false
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mvirtual_network_id[0m[0m    = (known after apply)
    }

[1m  # module.shared.azurerm_private_dns_zone_virtual_network_link.new_dev_portal_vnetlink[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "new_dev_portal_vnetlink" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "dev-portal-vnet-link"
      [32m+[0m [0m[1m[0mprivate_dns_zone_name[0m[0m = "developer.azure-api.net"
      [32m+[0m [0m[1m[0mregistration_enabled[0m[0m  = false
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mvirtual_network_id[0m[0m    = (known after apply)
    }

[1m  # module.shared.azurerm_private_dns_zone_virtual_network_link.scm_vnetlink[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "scm_vnetlink" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "scm-vnet-link"
      [32m+[0m [0m[1m[0mprivate_dns_zone_name[0m[0m = "scm.azure-api.net"
      [32m+[0m [0m[1m[0mregistration_enabled[0m[0m  = false
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0mvirtual_network_id[0m[0m    = (known after apply)
    }

[1m  # module.shared.azurerm_resource_group.shared_rg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "shared_rg" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-shared-lza-prod-eastus-001"
    }

[1m  # module.shared.azurerm_virtual_machine_extension.deploy_agent[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_machine_extension" "deploy_agent" {
      [32m+[0m [0m[1m[0mfailure_suppression_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "devops_agent"
      [32m+[0m [0m[1m[0mpublisher[0m[0m                   = "Microsoft.Compute"
      [32m+[0m [0m[1m[0msettings[0m[0m                    = (sensitive)
      [32m+[0m [0m[1m[0mtype[0m[0m                        = "CustomScriptExtension"
      [32m+[0m [0m[1m[0mtype_handler_version[0m[0m        = "1.10"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m          = (known after apply)
    }

[1m  # module.shared.azurerm_windows_virtual_machine.agent_vm[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_windows_virtual_machine" "agent_vm" {
      [32m+[0m [0m[1m[0madmin_password[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0madmin_username[0m[0m             = "apimlzademo"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0menable_automatic_updates[0m[0m   = true
      [32m+[0m [0m[1m[0mextensions_time_budget[0m[0m     = "PT1H30M"
      [32m+[0m [0m[1m[0mhotpatching_enabled[0m[0m        = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                   = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m              = -1
      [32m+[0m [0m[1m[0mname[0m[0m                       = "jumpbox-prod"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mpatch_assessment_mode[0m[0m      = "ImageDefault"
      [32m+[0m [0m[1m[0mpatch_mode[0m[0m                 = "AutomaticByOS"
      [32m+[0m [0m[1m[0mplatform_fault_domain[0m[0m      = -1
      [32m+[0m [0m[1m[0mpriority[0m[0m                   = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m         = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m        = "rg-shared-lza-prod-eastus-001"
      [32m+[0m [0m[1m[0msize[0m[0m                       = "Standard_F2"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m         = (known after apply)

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "ReadWrite"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "WindowsServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "MicrosoftWindowsServer"
          [32m+[0m [0m[1m[0msku[0m[0m       = "2016-Datacenter"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }

      [32m+[0m [0mtermination_notification {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtimeout[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 49 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: //home/runner/work/_temp/appgw-iapim-func.46.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "//home/runner/work/_temp/appgw-iapim-func.46.tfplan"

```

</details>

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform ES-APIM Deploy`*